DataProcessors/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДублиНСИ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оригинал</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУдаленияДубля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияУдаленияДублейНСИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкиЗамены</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокЗамены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияУдаленияДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияУдаленияДублейНСИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалениеНеПланируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированаЗаменаСсылокИУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаСсылокИУдалениеПриостановленыИзЗаОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПравилаПоискаДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПоискаДублейНСИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переопределяемое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ДублиНСИ/Forms/РабочееМесто/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОтбор = Элементы.ОтборПоСостоянию.СписокВыбора;
	СписокОтбор.Очистить();
	СписокОтбор.Добавить(Перечисления.СостоянияУдаленияДублейНСИ.ПустаяСсылка(), НСтр("ru = 'Все'"));
	СписокОтбор.Добавить(Перечисления.СостоянияУдаленияДублейНСИ.ЗаменаСсылокИУдалениеПриостановленыИзЗаОшибок,
		НСтр("ru = 'Замена ссылок и удаление приостановлена из-за ошибок'"));
	СписокОтбор.Добавить(Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление,
		НСтр("ru = 'Запланирована замена ссылок и удаление'"));
	СписокОтбор.Добавить(Перечисления.СостоянияУдаленияДублейНСИ.УдалениеНеПланируется,
		НСтр("ru = 'Удаление не планируется'"));
	
	СохраненноеЗначениеТипа = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Обработка.ДублиНСИ", "РабочееМесто.ТипСправочника");
	Если ЗначениеЗаполнено(СохраненноеЗначениеТипа) Тогда
		ТипСправочника = СохраненноеЗначениеТипа;
	КонецЕсли;
	
	Элементы.ДекорацияПравилаПоискаДублейСсылка.Видимость =
		ПравоДоступа("Редактирование", Метаданные.Справочники.ПравилаПоискаДублейНСИ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		ПередЗакрытиемНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьРабочееМестоУдалениеДублейНСИ" Тогда
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
			ТипСправочника = Параметр;
		КонецЕсли;
		
		ПодключитьОбновлениеДерева();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбновлениеДерева();
	ПодключитьОбновлениеОтборовСпискаДублейНСИ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСправочникаПриИзменении(Элемент)
	ПодключитьОбновлениеДерева(Истина);
	ПодключитьОбновлениеОтборовСпискаДублейНСИ();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСостояниюПриИзменении(Элемент)
	ПодключитьОбновлениеОтборовСпискаДублейНСИ();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПравилаПоискаДублейСсылкаНажатие(Элемент)
	ОткрытьФорму("Справочник.ПравилаПоискаДублейНСИ.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоКПодтверждению

&НаКлиенте
Процедура ДеревоКПодтверждениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = Поле.Имя;
	
	Если ИмяПоля = "ДеревоКПодтверждениюГруппаДублей" Тогда
		ПоказатьЗначениеЕслиЗаполнено(ТекущиеДанные.Дубль);
		
	ИначеЕсли ИмяПоля = "ДеревоКПодтверждениюПравилоОтветственный" Тогда
		ПоказатьЗначениеЕслиЗаполнено(ТекущиеДанные.ПравилоОтветственный);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДублиНСИ

&НаСервереБезКонтекста
Процедура СписокДублиНСИПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Дубли = Новый Массив;
	Для Каждого Ключ Из Строки.ПолучитьКлючи() Цикл
		Дубли.Добавить(Ключ.Дубль);
	КонецЦикла;
	
	ПометкиУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Дубли, "ПометкаУдаления");
	МодульОбработки = Обработки.ДублиНСИ;
	
	Для Каждого СтрокаДубль Из Строки Цикл
		ДанныеСтроки = СтрокаДубль.Значение.Данные;
		ДанныеСтроки.ИндексКартинки = Число(ПометкиУдаления[ДанныеСтроки.Дубль]) + 1;
		ДанныеСтроки.МестИспользования = МодульОбработки.ПредставлениеМестИспользования(
			ДанныеСтроки.КоличествоМестИспользования, ДанныеСтроки.ДатаПоискаМестИспользования)
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДублиНСИВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = Поле.Имя;
	
	Если ИмяПоля = "СписокДублиНСИОшибкиЗамены"
		И ЗначениеЗаполнено(ТекущиеДанные.ОшибкиЗамены) Тогда
		
		ПараметрыОткрытия = ОшибкиЗаменыДубля(ТекущиеДанные.Дубль);
		ОткрытьФорму("Обработка.ДублиНСИ.Форма.НеудачныеЗамены", ПараметрыОткрытия, , , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ИмяПоля = "СписокДублиНСИДубль" Тогда
		ПоказатьЗначениеЕслиЗаполнено(ТекущиеДанные.Дубль);
		
	ИначеЕсли ИмяПоля = "СписокДублиНСИОригинал" Тогда
		ПоказатьЗначениеЕслиЗаполнено(ТекущиеДанные.Оригинал);
		
	ИначеЕсли ИмяПоля = "СписокДублиНСИОтветственный" Тогда
		ПоказатьЗначениеЕслиЗаполнено(ТекущиеДанные.Ответственный);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СравнитьИПодтвердить(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоКПодтверждению.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		
		ТекущаяГруппа = Элементы.ДеревоКПодтверждению.ТекущиеДанные.ИдентификаторГруппы;
		
	ИначеЕсли ВыделенныеСтроки.Количество() > 1 Тогда
		
		ТекущаяГруппа = Элементы.ДеревоКПодтверждению.ДанныеСтроки(ВыделенныеСтроки[0]).ИдентификаторГруппы;
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			Если Элементы.ДеревоКПодтверждению.ДанныеСтроки(Строка).ИдентификаторГруппы <> ТекущаяГруппа Тогда
				Текст = НСтр("ru = 'Для объединения дубли должны находиться в одной группе.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Текст = НСтр("ru = 'Для объединения дублей необходимо выбрать хотя бы один элемент.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторГруппы", ТекущаяГруппа);
	ПараметрыОткрытия.Вставить("ИдентификаторОбъектаМетаданных", ТипСправочника);
	ОткрытьФорму("Обработка.ДублиНСИ.Форма.СравнениеИПодтверждениеДублей", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьМестаИспользования(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаКПодтверждению" Тогда
		ПересчитатьМестаИспользованияДеревоКПодтверждению();
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаСписокДублей" Тогда
		ПересчитатьМестаИспользованияСписокДублейНСИНаСервере(ДублиПоВыделеннымСтрокамСписка());
		Элементы.СписокДублиНСИ.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМестаИспользования(Команда)
	
	Ссылки = Новый Массив;
	Для Каждого Строка Из Элементы.СписокДублиНСИ.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.СписокДублиНСИ.ДанныеСтроки(Строка);
		Ссылки.Добавить(ДанныеСтроки.Дубль);
	КонецЦикла;
	
	ПоискИУдалениеДублейКлиент.ПоказатьМестаИспользования(Ссылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьЗаменуСсылокИУдаление(Команда)
	
	ТекущиеДанные = Элементы.СписокДублиНСИ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗапланироватьЗаменуСсылокИУдалениеНаСервере(ДублиПоВыделеннымСтрокамСписка());
	Элементы.СписокДублиНСИ.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура НеУдалять(Команда)
	
	ТекущиеДанные = Элементы.СписокДублиНСИ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НеУдалятьНаСервере(ДублиПоВыделеннымСтрокамСписка());
	Элементы.СписокДублиНСИ.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзСпискаДублей(Команда)
	
	Если Элементы.СписокДублиНСИ.ВыделенныеСтроки.Количество() Тогда
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить("СнятьПометку", НСтр("ru='Снять пометку'"));
		Кнопки.Добавить("НеСнимать", НСтр("ru='Не снимать'"));
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеОтветаОСнятииПометки", ЭтотОбъект),
			НСтр("ru = 'Отмеченные элементы будут исключены из списка дублей. Снять пометку удаления?'"),
			Кнопки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеЗаменыДублей(Команда)
	
	СведенияОРегламентномЗадании = СведенияОРегламентномЗадании();
	
	Обработчик = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект);
	
	Если СведенияОРегламентномЗадании.РазделениеВключено Тогда
		Результат = Новый Структура("Использование,Расписание");
		ЗаполнитьЗначенияСвойств(Результат, СведенияОРегламентномЗадании);
		ВыполнитьОбработкуОповещения(Обработчик, СведенияОРегламентномЗадании.Расписание);
	Иначе
		ОписаниеРегламентногоЗадания = СведенияОРегламентномЗадании.Расписание;
		Расписание = Новый РасписаниеРегламентногоЗадания;
		ЗаполнитьЗначенияСвойств(Расписание, ОписаниеРегламентногоЗадания);
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
		Диалог.Показать(Обработчик);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключитьОбновлениеДерева(ТолькоОбновить = Ложь)
	
	Элементы.ТипСправочника.Доступность = Ложь;
	Элементы.ГруппаОжидание.Видимость = Истина;
	Элементы.ДеревоКПодтверждению.Видимость = Ложь;
	
	Если ТолькоОбновить Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновлениеДерева", 0.1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("Подключаемый_ОбновлениеДереваПриОткрытии", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновлениеДереваПриОткрытии() Экспорт
	
	ПриОтложенномОбновленииДерева();
	
	Элементы.ТипСправочника.Доступность = Истина;
	Элементы.ГруппаОжидание.Видимость = Ложь;
	Элементы.ДеревоКПодтверждению.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновлениеДерева() Экспорт
	
	ОбновитьДеревоКПодтверждению();
	
	Элементы.ТипСправочника.Доступность = Истина;
	Элементы.ГруппаОжидание.Видимость = Ложь;
	Элементы.ДеревоКПодтверждению.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбновлениеОтборовСпискаДублейНСИ()
	ПодключитьОбработчикОжидания("Подключаемый_ОбновлениеОтборовСпискаДублейНСИ", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновлениеОтборовСпискаДублейНСИ() Экспорт
	ОбновитьОтборыСпискаДублейНСИ();
КонецПроцедуры

&НаСервере
Процедура ПриОтложенномОбновленииДерева()
	
	СписокТип = Элементы.ТипСправочника.СписокВыбора;
	СписокТип.Очистить();
	ТипыДубейСКоличеством = РегистрыСведений.ДублиНСИКПодтверждению.ТипыДубейСКоличеством();
	Для Каждого Строка Из ТипыДубейСКоличеством Цикл
		ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Строка.ТипСсылки);
		СписокТип.Добавить(Строка.ТипСсылки, ОбъектМетаданных.Синоним + " (" + Строка.КоличествоДублей + ")");
	КонецЦикла;
	
	ТипыДублейБезКоличества = РегистрыСведений.ДублиНСИ.ТипыДублей();
	Для Каждого Строка Из ТипыДублейБезКоличества Цикл
		Если ТипыДубейСКоличеством.Найти(Строка.ТипСсылки) = Неопределено Тогда
			ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Строка.ТипСсылки);
			СписокТип.Добавить(Строка.ТипСсылки, ОбъектМетаданных.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокТип.Количество() > 0 Тогда
		ТипСправочника = СписокТип[0].Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипСправочника) Тогда
		ОбновитьДеревоКПодтверждению();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДублиПоВыделеннымСтрокамСписка()
	
	Массив = Новый Массив;
	Для Каждого Строка Из Элементы.СписокДублиНСИ.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.СписокДублиНСИ.ДанныеСтроки(Строка);
		Массив.Добавить(ДанныеСтроки.Дубль);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ОбновитьДеревоКПодтверждению()
	
	ДеревоКПодтверждению.ПолучитьЭлементы().Очистить();
	
	ТекстДубли =
		"ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|	ДублиНСИКПодтверждению.ТипСсылки = &ТипСправочника";
		
	ТекстДерево =
		"ВЫБРАТЬ
		|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
		|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДублиНСИКПодтверждению.Дубль) КАК ДубльПредставление,
		|	ДублиНСИКПодтверждению.Источник КАК Источник,
		|	ДублиНСИКПодтверждению.ДатаДобавления КАК ДатаДобавления,
		|	ДублиНСИКПодтверждению.КоличествоМестИспользования КАК КоличествоМестИспользования,
		|	ДублиНСИКПодтверждению.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования
		|ИЗ
		|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
		|ГДЕ
		|	ДублиНСИКПодтверждению.ТипСсылки = &ТипСправочника
		|ИТОГИ
		|	МАКСИМУМ(Источник),
		|	МАКСИМУМ(ГруппаДублей)
		|ПО
		|	ДублиНСИКПодтверждению.ГруппаДублей";
		
	Запрос = Новый Запрос;
	ТекстРазделитель = ОбщегоНазначения.РазделительПакетаЗапросов();
	Запрос.Текст = ТекстДубли + ТекстРазделитель + ТекстДерево;
	Запрос.УстановитьПараметр("ТипСправочника", ТипСправочника);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Дубли = РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("Дубль");
	УстановитьПривилегированныйРежим(Истина);
	ПометкиУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Дубли, "ПометкаУдаления");
	УстановитьПривилегированныйРежим(Ложь);
	
	ЭлементыКорня = ДеревоКПодтверждению.ПолучитьЭлементы();
	ВыборкаГруппа = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппа.Следующий() Цикл
		
		СтрокаГруппа = ЭлементыКорня.Добавить();
		СтрокаГруппа.ПравилоОтветственный = ВыборкаГруппа.Источник;
		СтрокаГруппа.ИдентификаторГруппы = ВыборкаГруппа.ГруппаДублей;
		
		ЧастиПредставленияГруппы = Новый Массив;
		
		ЭлементыГруппы = СтрокаГруппа.ПолучитьЭлементы();
		Выборка = ВыборкаГруппа.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаДубль = ЭлементыГруппы.Добавить();
			СтрокаДубль.Дубль = Выборка.Дубль;
			СтрокаДубль.ДатаДобавления = Выборка.ДатаДобавления;
			СтрокаДубль.ИндексКартинки = Число(ПометкиУдаления[Выборка.Дубль]) + 1;
			СтрокаДубль.ИдентификаторГруппы = Выборка.ГруппаДублей;
			СтрокаДубль.МестИспользования = ПредставлениеМестИспользования(
				Выборка.КоличествоМестИспользования, Выборка.ДатаПоискаМестИспользования);
			
			ЧастиПредставленияГруппы.Добавить(Выборка.ДубльПредставление);
		КонецЦикла;
		
		СтрокаГруппа.ГруппаДублей = ПредставлениеГруппы(ЧастиПредставленияГруппы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеМестИспользования(Количество, Дата)
	Возврат Обработки.ДублиНСИ.ПредставлениеМестИспользования(Количество, Дата);
КонецФункции

&НаСервере
Функция ПредставлениеГруппы(Массив)
	
	Результат = "";
	ОграничениеДлины = 100;
	
	Для Каждого Элемент Из Массив Цикл
		Результат = ?(ПустаяСтрока(Результат), "", Результат + ", ") + Элемент;
		
		Если СтрДлина(Результат) > ОграничениеДлины Тогда
			Результат = Лев(Результат, ОграничениеДлины) + "...";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"Обработка.ДублиНСИ", "РабочееМесто.ТипСправочника", ТипСправочника);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыСпискаДублейНСИ()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДублиНСИ,
		"ТипСсылки",
		ТипСправочника,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДублиНСИ,
		"СостояниеУдаленияДубля",
		ОтборПоСостоянию,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ОтборПоСостоянию));
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьМестаИспользованияДеревоКПодтверждению()
	
	ДублиКОбновлению = Новый Массив;
	
	Для Каждого НомерСтроки Из Элементы.ДеревоКПодтверждению.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ДеревоКПодтверждению.ДанныеСтроки(НомерСтроки);
		
		Если ДанныеСтроки.Дубль = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДублиКОбновлению.Добавить(ДанныеСтроки.Дубль);
	КонецЦикла;
	
	ДанныеОбновления = ПересчитатьМестаИспользованияНаСервере(ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДублиКОбновлению));
	
	Для Каждого НомерСтроки Из Элементы.ДеревоКПодтверждению.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ДеревоКПодтверждению.ДанныеСтроки(НомерСтроки);
		ДанныеЗаписи = ДанныеОбновления[ДанныеСтроки.Дубль];
		
		Если ДанныеЗаписи <> Неопределено Тогда
			ДанныеСтроки.МестИспользования = ПредставлениеМестИспользования(
				ДанныеЗаписи.КоличествоМестИспользования, ДанныеЗаписи.ДатаПоискаМестИспользования);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьМестаИспользованияНаСервере(ДублиКОбновлению)
	Возврат РегистрыСведений.ДублиНСИКПодтверждению.ПеречитатьМестаИспользования(ДублиКОбновлению);
КонецФункции

&НаСервереБезКонтекста
Процедура ПересчитатьМестаИспользованияСписокДублейНСИНаСервере(ДублиКОбновлению)
	РегистрыСведений.ДублиНСИ.ПересчитатьМестаИспользования(ДублиКОбновлению);
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьЗаменуСсылокИУдалениеНаСервере(Дубли)
	
	РегистрыСведений.ДублиНСИ.ИзменитьСтатусУдаленияДублей(
		Дубли,
		Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление);
	
КонецПроцедуры

&НаСервере
Процедура НеУдалятьНаСервере(Дубли)
	
	РегистрыСведений.ДублиНСИ.ИзменитьСтатусУдаленияДублей(
		Дубли,
		Перечисления.СостоянияУдаленияДублейНСИ.УдалениеНеПланируется);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОСнятииПометки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	СнятьПометку = (РезультатВопроса = "СнятьПометку");
	
	ИсключитьИзСпискаДублейНаСервере(ДублиПоВыделеннымСтрокамСписка(), СнятьПометку);
	Элементы.СписокДублиНСИ.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ИсключитьИзСпискаДублейНаСервере(Дубли, СнятьПометку)
	
	НачатьТранзакцию();
	Попытка
		РегистрыСведений.ДублиНСИ.УдалитьДубли(Дубли, СнятьПометку);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ОшибкиЗаменыДубля(Дубль)
	Возврат РегистрыСведений.ДублиНСИ.ОшибкиЗаменыДубля(Дубль);
КонецФункции

&НаКлиенте
Процедура ПоказатьЗначениеЕслиЗаполнено (Объект)
	
	Если ЗначениеЗаполнено(Объект) Тогда
		ПоказатьЗначение(, Объект);
	КонецЕсли;
	
КонецПроцедуры

#Область РасписаниеРегламентногоЗадания

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(Расписание, ПараметрыВыполнения) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьИзменениеРасписания(Новый Структура("Расписание", Расписание));
	
КонецПроцедуры

&НаСервере
Функция СведенияОРегламентномЗадании()
	
	Результат = Новый Структура;
	Результат.Вставить("Использование", Ложь);
	Результат.Вставить("Расписание", ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(
		Новый РасписаниеРегламентногоЗадания));
	Результат.Вставить("РазделениеВключено", ОбщегоНазначения.РазделениеВключено());
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗаменаДублейНСИ);
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Если Задания.Количество() > 0 Тогда
		Задание = Задания[0];
		Результат.Использование = Задание.Использование;
		Если Результат.РазделениеВключено Тогда
			Результат.Расписание = Задание.Расписание;
		Иначе
			Результат.Расписание = РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(
				Задание.УникальныйИдентификатор, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СохранитьИзменениеРасписания(Изменения)
	
	Если Не Пользователи.ЭтоПолноправныйПользователь( , , Ложь) Тогда
		ВызватьИсключение(НСтр("ru = 'Недостаточно прав для выполнения операции.'"), КатегорияОшибки.НарушениеПравДоступа);
	КонецЕсли;
	
	НовыеНастройки = Новый Структура;
	НовыеНастройки.Вставить("Расписание", Изменения.Расписание);
	ИдентификаторЗадания = РегламентныеЗаданияСервер.УникальныйИдентификатор(
		Метаданные.РегламентныеЗадания.ЗаменаДублейНСИ);
	РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторЗадания, НовыеНастройки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
